#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_password.pass["infra-azure-foundations-stack-adi-tenant"]: Refreshing state... [id=none]
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=26aa7ec7-96f9-4fda-a56c-b330c975f800-8e001e75-263f-4b2f-931e-f2037fcc675f-a26cff92-ab53-4342-8e68-f96dd7bbd9b4]
azuread_application.github_actions_aadapplication["infra-azure-foundations-preview"]: Refreshing state... [id=/applications/9e1b6b1f-f586-4923-a31f-3f557af2128a]
azuread_application.github_actions_aadapplication["telemetry-test"]: Refreshing state... [id=/applications/41b91d62-e4b4-4361-9c07-8c1e024f5690]
azuread_application.github_actions_aadapplication["tf-github-repo-management"]: Refreshing state... [id=/applications/912b61f9-737f-4c60-8dd8-c2af36fbc44b]
azuread_application.github_actions_aadapplication["tf-sandbox"]: Refreshing state... [id=/applications/5e3da8bf-1ebb-4b6f-96ee-17f1eb4c5d55]
azuread_application.github_actions_aadapplication["azure-functions-playground"]: Refreshing state... [id=/applications/96051860-a27e-4eeb-9008-ef3227af90fd]
azuread_application.github_actions_aadapplication["infra-azure-foundations-infra"]: Refreshing state... [id=/applications/1d96e67e-d28b-464f-ad0c-4f2b4823530c]
azuread_application.github_actions_aadapplication["backstage_test"]: Refreshing state... [id=/applications/96fd3546-c563-4995-b477-88da8c572ba5]
azuread_application.github_actions_aadapplication["apim-managed-test-dev"]: Refreshing state... [id=/applications/b2d7c879-b315-4ae9-bf46-46f6ce9fd882]
azuread_application_federated_identity_credential.cred["infra-azure-foundations-preview"]: Refreshing state... [id=9e1b6b1f-f586-4923-a31f-3f557af2128a/federatedIdentityCredential/330a6fb9-5fa7-483d-a4c6-6b9474546eb2]
azuread_application_federated_identity_credential.cred["tf-github-repo-management"]: Refreshing state... [id=912b61f9-737f-4c60-8dd8-c2af36fbc44b/federatedIdentityCredential/e920d867-cc2c-4cff-82ac-c39bba3a52b9]
azuread_application_federated_identity_credential.cred["tf-sandbox"]: Refreshing state... [id=5e3da8bf-1ebb-4b6f-96ee-17f1eb4c5d55/federatedIdentityCredential/c85dfb45-807d-4473-a4bf-1c9901ed24aa]
azuread_application_federated_identity_credential.cred["backstage_test"]: Refreshing state... [id=96fd3546-c563-4995-b477-88da8c572ba5/federatedIdentityCredential/780736fb-df2b-4609-80e8-eab432153ec6]
azuread_application_federated_identity_credential.cred["infra-azure-foundations-infra"]: Refreshing state... [id=1d96e67e-d28b-464f-ad0c-4f2b4823530c/federatedIdentityCredential/62e9c61e-197e-446a-895f-d1a6b1e7f5fd]
azuread_application_federated_identity_credential.cred["apim-managed-test-dev"]: Refreshing state... [id=b2d7c879-b315-4ae9-bf46-46f6ce9fd882/federatedIdentityCredential/bf28ed1a-9dce-4d7b-b060-2ef4afbc37ac]
azuread_application_federated_identity_credential.cred["telemetry-test"]: Refreshing state... [id=41b91d62-e4b4-4361-9c07-8c1e024f5690/federatedIdentityCredential/389950b0-d4f6-41a7-92fd-56e7fa17df32]
azuread_service_principal.github_actions_sp["infra-azure-foundations-infra"]: Refreshing state... [id=/servicePrincipals/aa825f20-3155-4281-93b5-d330efc95ecd]
azuread_application_federated_identity_credential.cred["azure-functions-playground"]: Refreshing state... [id=96051860-a27e-4eeb-9008-ef3227af90fd/federatedIdentityCredential/be9764f4-91f1-4a0c-8fd6-c7faf47f66f5]
azuread_service_principal.github_actions_sp["tf-sandbox"]: Refreshing state... [id=/servicePrincipals/b9d819c2-e68a-4d3c-862d-692c9716e8bd]
azuread_service_principal.github_actions_sp["apim-managed-test-dev"]: Refreshing state... [id=/servicePrincipals/a112bfb0-88fb-46f5-a19b-e00ba99c51a4]
azuread_service_principal.github_actions_sp["tf-github-repo-management"]: Refreshing state... [id=/servicePrincipals/1b1ecaef-d090-4fa5-9fc4-5adb820e3137]
azuread_service_principal.github_actions_sp["infra-azure-foundations-preview"]: Refreshing state... [id=/servicePrincipals/3a427014-4c37-4e23-91c9-ab25abe46cfd]
azuread_service_principal.github_actions_sp["backstage_test"]: Refreshing state... [id=/servicePrincipals/a7661791-72fe-4907-a9b2-2aa885ef3ea5]
azuread_service_principal.github_actions_sp["azure-functions-playground"]: Refreshing state... [id=/servicePrincipals/5ac34ad8-49f7-4bc7-af91-ce78cf9f4590]
azuread_service_principal.github_actions_sp["telemetry-test"]: Refreshing state... [id=/servicePrincipals/23026963-a170-4d19-b79f-eccca0caeedd]
data.azuread_service_principals.key_readers: Reading...
data.azuread_service_principals.secret_readers: Reading...
data.azuread_service_principals.secret_readers: Read complete after 1s [id=serviceprincipals#cTRnsGKpJlZf8kXFixKYn9f4YAY=]
data.azuread_service_principals.key_readers: Read complete after 3s [id=serviceprincipals#cTRnsGKpJlZf8kXFixKYn9f4YAY=]
azurerm_resource_group.instance["apim-managed-test-dev"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-apim-managed-test]
azurerm_resource_group.instance["telemetry-test"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common]
azurerm_key_vault.pulumi_kv: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.KeyVault/vaults/kv-badbort-pulumi-pw]
azurerm_storage_account.terraform_state_storage: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-file-data-smb-share-elevated-contributor"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/2610632b-49d6-08c9-0350-ecd4f8be59ff]
azurerm_role_assignment.instance["telemetry-test"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/1cf427ea-8c55-8d3c-dd04-8d0d17a24b42]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-owner"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/15116935-e421-e5e3-6cc2-9ce915972712]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-blob-data-owner"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/b04f660b-1d9b-7ea2-5bba-06fbe80b49d8]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-file-data-privileged-contributor"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/ebc555c7-dc87-b49a-38cd-3cf04e9bb428]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-table-data-contributor"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/f93adc2a-3d5f-e2e2-9cc6-9f6187b5471a]
azurerm_role_assignment.instance["apim-managed-test-dev"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-apim-managed-test/providers/Microsoft.Authorization/roleAssignments/1e010d8c-cf0b-ac86-7e40-4b54a6f3aeed]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-account-contributor"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/8b3472de-97fe-9db5-0e41-c808e9da4d48]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-user-access-administrator"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/4a9c3354-432f-ffb0-c151-daa40999694d]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-file-data-smb-share-contributor"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/6ea8e84f-27bd-e1c8-a253-9edeeb287f32]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-azure-service-bus-data-owner"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/a37300fd-ddac-dcc3-6373-99d53b256f1e]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-key-vault-administrator"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/d476f5fe-b965-d92f-c4f2-73e3ec6c8d76]
azurerm_key_vault_key.pulumi_keys["infra-azure-foundations-stack-adi-tenant"]: Refreshing state... [id=https://kv-badbort-pulumi-pw.vault.azure.net/keys/infra-azure-foundations-stack-adi-tenant/f434ec0f09604d52ad5190adead3aa1a]
azurerm_key_vault_secret.pulumi_secrets["infra-azure-foundations-stack-adi-tenant"]: Refreshing state... [id=https://kv-badbort-pulumi-pw.vault.azure.net/secrets/infra-azure-foundations-stack-adi-tenant/57300b0850d9440cb24855592cb70f39]
azurerm_role_assignment.secret_readers["infra-azure-foundations-stack-adi-tenant|github-actions-infra-azure-foundations-infra"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.KeyVault/vaults/kv-badbort-pulumi-pw/secrets/infra-azure-foundations-stack-adi-tenant/providers/Microsoft.Authorization/roleAssignments/a7abbd81-9bc6-04d2-f393-c895a0e94c5a]
azurerm_role_assignment.secret_readers["infra-azure-foundations-stack-adi-tenant|github-actions-infra-azure-foundations-preview"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.KeyVault/vaults/kv-badbort-pulumi-pw/secrets/infra-azure-foundations-stack-adi-tenant/providers/Microsoft.Authorization/roleAssignments/a332ba75-ba9e-356b-771a-1dfd957ed3d7]
azurerm_role_assignment.key_readers["infra-azure-foundations-stack-adi-tenant|github-actions-infra-azure-foundations-preview"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.KeyVault/vaults/kv-badbort-pulumi-pw/keys/infra-azure-foundations-stack-adi-tenant/providers/Microsoft.Authorization/roleAssignments/f832a0ed-a6ed-c5a1-29d5-72920482a552]
azurerm_role_assignment.key_readers["infra-azure-foundations-stack-adi-tenant|github-actions-infra-azure-foundations-infra"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.KeyVault/vaults/kv-badbort-pulumi-pw/keys/infra-azure-foundations-stack-adi-tenant/providers/Microsoft.Authorization/roleAssignments/749187d3-de36-6803-0295-24b17cd5fa64]
azurerm_storage_container.tf_backends_sc["backstage_test"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta/blobServices/default/containers/backstage-test]
azurerm_storage_container.tf_backends_sc["apim-managed-test"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta/blobServices/default/containers/apim-managed-test]
azurerm_storage_container.ad_tf_backends["telemetry-test"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta/blobServices/default/containers/telemetry-test]
azurerm_storage_container.ad_tf_backends["infra-azure-foundations-infra"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta/blobServices/default/containers/infra-azure-foundations]
azurerm_storage_container.terraform_state: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/common-infrastructure-tfstate]
azurerm_storage_container.tf_backends_sc["tf-github-repo-management"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta/blobServices/default/containers/tf-github-repo-management]
azurerm_role_assignment.backend_ad_blob_contributor["telemetry-test"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta/blobServices/default/containers/telemetry-test/providers/Microsoft.Authorization/roleAssignments/85b55f61-83b0-556d-2b76-d0aea1378e1c]
azurerm_role_assignment.backend_ad_blob_contributor["infra-azure-foundations-infra"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta/blobServices/default/containers/infra-azure-foundations/providers/Microsoft.Authorization/roleAssignments/8c105e1a-b8e9-2db3-eb6b-a70cb3c3cc4a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.instance["telemetry-test"] will be created
  + resource "azurerm_resource_group" "instance" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "rg-telemetry-test"
    }

  # azurerm_role_assignment.custom_rg_assignments["telemetry-test-azure-service-bus-data-owner"] will be created
  + resource "azurerm_role_assignment" "custom_rg_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.custom_rg_assignments["telemetry-test-key-vault-administrator"] will be created
  + resource "azurerm_role_assignment" "custom_rg_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.custom_rg_assignments["telemetry-test-owner"] will be created
  + resource "azurerm_role_assignment" "custom_rg_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-account-contributor"] will be created
  + resource "azurerm_role_assignment" "custom_rg_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-blob-data-owner"] will be created
  + resource "azurerm_role_assignment" "custom_rg_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-file-data-privileged-contributor"] will be created
  + resource "azurerm_role_assignment" "custom_rg_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage File Data Privileged Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-file-data-smb-share-contributor"] will be created
  + resource "azurerm_role_assignment" "custom_rg_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage File Data SMB Share Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-file-data-smb-share-elevated-contributor"] will be created
  + resource "azurerm_role_assignment" "custom_rg_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage File Data SMB Share Elevated Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-table-data-contributor"] will be created
  + resource "azurerm_role_assignment" "custom_rg_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.custom_rg_assignments["telemetry-test-user-access-administrator"] will be created
  + resource "azurerm_role_assignment" "custom_rg_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.instance["telemetry-test"] will be created
  + resource "azurerm_role_assignment" "instance" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23026963-a170-4d19-b79f-eccca0caeedd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_container.tf_backends_sc["hackathon-2026"] will be created
  + resource "azurerm_storage_container" "tf_backends_sc" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = {
          + "repo" = "https://github.com/racwasandbox/hackathon-spec-driven"
        }
      + name                              = "apim-managed-test"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with azurerm_storage_container.terraform_state,
  on main.tf line 31, in resource "azurerm_storage_container" "terraform_state":
  31:   storage_account_name  = azurerm_storage_account.terraform_state_storage.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @badbort, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/terraform.yml`*